In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [4]:
%%sql
SELECT *
FROM facts
LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [19]:
%%sql
SELECT MIN(population) as "Minimum Population",
        MAX(population) as "Maximum Population",
        MIN(population_growth) as "Minimum Growth",
        MAX(population_growth) as "Maximum Growth"
FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [21]:
%%sql
SELECT name, population
FROM facts
WHERE population = (SELECT MIN(population)
                    FROM facts)

Done.

[('Antarctica', 0)]

In [22]:
%%sql
SELECT name, population
FROM facts
WHERE population = (SELECT MAX(population)
                    FROM facts)

Done.

[('World', 7256490011)]

In [24]:
%%sql
SELECT MIN(population) as "Minimum Population",
        MAX(population) as "Maximum Population",
        MIN(population_growth) as "Minimum Growth",
        MAX(population_growth) as "Maximum Growth"
FROM facts
WHERE NOT name = "World"

Done.

[(0, 1367485388, 0.0, 4.02)]

In [26]:
%%sql
SELECT AVG(population), AVG(area)
FROM facts
WHERE NOT name = "World"

Done.

[(32242666.56846473, 555093.546184739)]

In [ ]:
%%sql
SELECT name, population, area
FROM facts
WHERE
population > (SELECT AVG(population)
              FROM facts
              WHERE NOT name = "World")
AND
area < (SELECT AVG(area)
        FROM facts
        WHERE NOT name = "World")